from utils import important_message

def main() -> None:
    """ Из функции main вызывается функция important_message, находящуюся в файле utils.py.
        Возвращаемое значение функции important_message выводится в stdout c дополнительными символами 
        конца строк до и после возвращаемого значения. 
        Функция не принимает аргументы и возвращает объект None. """
        
    txt = input("текст сообщения: ")
    print(important_message(txt))
        
        
text = 'Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы'
msg = important_message(text)
print(msg)

# >>> main()
# текст сообщения: ЗАГОЛОВОК ПРОГРАММЫ

#==================================================================#
#                                                                  #
#                       ЗАГОЛОВОК ПРОГРАММЫ                        #
#                                                                  #
#==================================================================#

# >>> text = 'Обратите внимание на очень важное сообщение от команды разработчи\ков этой великолепной программы'
# >>> msg = important_message(text)
# >>> print(msg)

#==================================================================#
#                                                                  #
#     Обратите внимание на очень важное сообщение от команды       #
#            разработчиков этой великолепной программы             #
#                                                                  #
#==================================================================#