from sys import stdin, stdout

text_in, text_out = "", ""
chars = ".,:;!?–—\'\"()*/"
chars_out = []
for string in stdin:
    text_in = string
    break
    
for _, char in enumerate(text_in):
    if char not in chars:
        chars_out.append(char)
        
text_out = "".join(chars_out)
stdout.write("\n" + text_out)



# C:\My\Учеба\Kolbin\Kolbin\2024.11.03
 # 13:25:45 > python 7.py
# Было темно в гостиной. Лаптев, не садясь и держа шляпу в руках, стал извиняться за беспокойство; он спросил, что делать, чтобы сестра спала по ночам, и отчего она так страшно худеет, и его смущала мысль, что, кажется, эти самые вопросы он уже задавал доктору сегодня во время его утреннего визита.

# Было темно в гостиной Лаптев не садясь и держа шляпу в руках стал извиняться за беспокойство он спросил что делать чтобы сестра спала по ночам и отчего она так страшно худеет и его смущала мысль что кажется эти самые вопросы он уже задавал доктору сегодня во время его утреннего визита